In [1]:
import pandas as pd

In [2]:
data_A = {'key': [1,2,3], 'name': ['Jane', 'John', 'Peter']}
dataframe_A = pd.DataFrame(data_A, columns = ['key', 'name'])

data_B = {'key': [2,3,4], 'age': [18, 15, 20]}
dataframe_B = pd.DataFrame(data_B, columns = ['key', 'age'])

print(dataframe_A)
print(dataframe_B)

   key   name
0    1   Jane
1    2   John
2    3  Peter
   key  age
0    2   18
1    3   15
2    4   20

데이터프레임간의 INNER_JOIN

In [4]:
df_INNER_JOIN=pd.merge(dataframe_A,dataframe_B,left_on='key',right_on='key',how='inner')
df_INNER_JOIN

   key   name  age
0    2   John   18
1    3  Peter   15

데이터프레임간의 OUTER_JOIN

In [6]:
df_OUTER_JOIN=pd.merge(dataframe_A,dataframe_B,left_on='key',right_on='key',how='outer')
df_OUTER_JOIN

   key   name   age
0    1   Jane   NaN
1    2   John  18.0
2    3  Peter  15.0
3    4    NaN  20.0

데이터프레임간의 RIGHT_JOIN

In [7]:
df_RIGHT_JOIN=pd.merge(dataframe_A,dataframe_B,left_on='key',right_on='key',how='right')
df_RIGHT_JOIN

   key   name  age
0    2   John   18
1    3  Peter   15
2    4    NaN   20

데이터프레임간의 LEFT_JOIN

In [8]:
df_LEFT_JOIN=pd.merge(dataframe_A,dataframe_B,left_on='key',right_on='key',how='left')
df_LEFT_JOIN

   key   name   age
0    1   Jane   NaN
1    2   John  18.0
2    3  Peter  15.0